#### FlowConversionMode Enumeration

---

|  |
| --- |
| See Also |

Enumerated type listing possible flow conversion modes for piping calculations.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum FlowConversionMode ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration FlowConversionMode ``` |

| Visual C++ |
| --- |
| ``` public enum class FlowConversionMode ``` |

# Members

| Member name | Description |
| --- | --- |
| Invalid | A default value which should not be assigned to system types. |
| Valves | Predominantly flush valves. |
| Tanks | Predominantly flush tanks. |

# See Also

Autodesk.Revit.DB.Plumbing Namespace